OpenFOAM-11/tutorials/multiRegion/film/rivuletPanel/0/film/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 -0.075 0);
        // value           uniform (0 -0.25 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            noSlip;
    }

    wall
    {
        type            noSlip;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
